
a = ["Вишневская","Калинина","Ленина","Комарова","Васильева","Бусаров","Елагин","Груздева","Моесеева","Кудрявцева"]
b = ["Авдеева","Иванов","Аверин","Федоров","Абрамова","Потапов","Глебов","Яшкова","Жуков","Быстров"]

c = tuple([a[0],b[1],b[6],a[1],a[9]])

print(f"Исходный список 1: {a}")
print(f"Исходный список 2: {b}")
print(f"Полученный кортеж: {c}")
print(f"Длина кортежа: {len(c)}")
print(f"Отсортированный кортеж: {sorted(c)}")
if "Иванов" in c:
    print("Иванов есть в кортеже")
    c.count("Иванов")
else: print("Иванова нет в кортеже")
